# Parameter Type Id Rebar Shape Termination Rotation At End Property

Source: https://www.revitapidocs.com/2026/8fb35acb-1c0e-8495-767f-2be2e16d6bae.htm

---

| Parameter Type Id Rebar Shape Termination Rotation At End Property |
| --- |

"Rotation At End"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeTerminationRotationAtEnd { get; }
```

```
Public Shared ReadOnly Property RebarShapeTerminationRotationAtEnd As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeTerminationRotationAtEnd {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeTerminationRotationAtEnd : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace